In [1]:
import numpy as np
import pandas as pd

In [3]:
data = pd.DataFrame({'k1':['one']*3+['two']*4,
                    'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

DataFrame의 `duplicated` 메서드는 각 로우가 중복인지 아닌지를 알려주는 불리언 Series 객체를 반환한다.

In [4]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

`drop_duplicates` 는 duplicated 배열이 False인 DataFrame을 반환한다.

In [6]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

이 두 메서드는 기본적으로 모든 컬럼에 적용되며 중복을 찾아내기 위한 부분합을 따로 지정해 줄 수도 있다.<br/>
새로운 컬럼을 하나 추가하고 k1 컬럼에 기반헤서 중복을 걸러내려면 다음과 같이 해야한다.

In [7]:
data['v1']=range(7)

In [8]:
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [9]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

`duplicated`와 `drop_duplicates`는 기본적으로 처음 발견된 값을 유지한다. keep='last' 옵션을 넘기면 마지막으로 발견된 값을 반환한다.

In [10]:
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [11]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6